<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"87acb219fa0de16f37bee611717df9f03cbf4f2213a3a76a4ffa5588a700df96","plan_job_ref":"Job Terraform Plan #34 at https://github.com/cal-itp/cal-bc/actions/runs/18662449168","plan_out_hash":"45a05ce765ce17b450d3105e24b2c3774ebaeda6faf7943e40b823dde90344b4","plan_hash":"2e3b62657ca21a26470d9ea2361bdfb037e26e64a68c6858e8e6ff5355c89a97","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 5 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_secret_manager_secret.cal-bc-staging-database-url will be created
+   resource "google_secret_manager_secret" "cal-bc-staging-database-url" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "goog-terraform-provisioned" = "true"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       name                  = (known after apply)
+       project               = "cal-itp-data-infra-staging"
+       secret_id             = "***************************"
+       terraform_labels      = {
+           "goog-terraform-provisioned" = "true"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.cal-bc-staging-secret-key will be created
+   resource "google_secret_manager_secret" "cal-bc-staging-secret-key" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "goog-terraform-provisioned" = "true"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       name                  = (known after apply)
+       project               = "cal-itp-data-infra-staging"
+       secret_id             = "*************************"
+       terraform_labels      = {
+           "goog-terraform-provisioned" = "true"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret_version.cal-bc-staging-database-url will be created
+   resource "google_secret_manager_secret_version" "cal-bc-staging-database-url" {
+       create_time            = (known after apply)
+       deletion_policy        = "DELETE"
+       destroy_time           = (known after apply)
+       enabled                = true
+       id                     = (known after apply)
+       is_secret_data_base64  = false
+       name                   = (known after apply)
+       secret                 = (known after apply)
+       secret_data_wo         = (write-only attribute)
+       secret_data_wo_version = 0
+       version                = (known after apply)
    }

  # google_secret_manager_secret_version.cal-bc-staging-secret-key will be created
+   resource "google_secret_manager_secret_version" "cal-bc-staging-secret-key" {
+       create_time            = (known after apply)
+       deletion_policy        = "DELETE"
+       destroy_time           = (known after apply)
+       enabled                = true
+       id                     = (known after apply)
+       is_secret_data_base64  = false
+       name                   = (known after apply)
+       secret                 = (known after apply)
+       secret_data_wo         = (write-only attribute)
+       secret_data_wo_version = 0
+       version                = (known after apply)
    }

  # module.cloud-run.google_cloud_run_service.main is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "main" {
!~      id                         = "********************************************************************************" -> (known after apply)
        name                       = "cal-bc-staging"
!~      status                     = [
-           {
-               conditions                   = [
-                   {
-                       message = <<-EOT
                            The user-provided container failed to start and listen on the port defined provided by the PORT=8000 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=cal-itp-data-infra-staging&resource=cloud_run_revision/service_name/cal-bc-staging/revision_name/cal-bc-staging-00001-wxq&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22cal-bc-staging%22%0Aresource.labels.revision_name%3D%22cal-bc-staging-00001-wxq%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
-                       reason  = "HealthCheckContainerError"
-                       status  = "False"
-                       type    = "Ready"
                    },
-                   {
-                       message = <<-EOT
                            The user-provided container failed to start and listen on the port defined provided by the PORT=8000 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=cal-itp-data-infra-staging&resource=cloud_run_revision/service_name/cal-bc-staging/revision_name/cal-bc-staging-00001-wxq&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22cal-bc-staging%22%0Aresource.labels.revision_name%3D%22cal-bc-staging-00001-wxq%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
-                       reason  = "HealthCheckContainerError"
-                       status  = "False"
-                       type    = "ConfigurationsReady"
                    },
-                   {
-                       message = <<-EOT
                            The user-provided container failed to start and listen on the port defined provided by the PORT=8000 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=cal-itp-data-infra-staging&resource=cloud_run_revision/service_name/cal-bc-staging/revision_name/cal-bc-staging-00001-wxq&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22cal-bc-staging%22%0Aresource.labels.revision_name%3D%22cal-bc-staging-00001-wxq%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
-                       reason  = "HealthCheckContainerError"
-                       status  = "False"
-                       type    = "RoutesReady"
                    },
                ]
-               latest_created_revision_name = "cal-bc-staging-00001-wxq"
-               observed_generation          = 1
-               traffic                      = []
#                (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
#        (3 unchanged attributes hidden)

!~      metadata {
!~          effective_annotations = {
-               "run.googleapis.com/ingress-status" = "all" -> null
-               "run.googleapis.com/operation-id"   = "e6649b40-b014-4f92-bc12-798ec670a6b8" -> null
-               "run.googleapis.com/urls"           = jsonencode(
                    [
-                       "https://cal-bc-staging-473674835135.us-west2.run.app",
                    ]
                ) -> null
-               "serving.knative.dev/creator"       = "Rae.Bonfanti@dot.ca.gov (global/workforcePools/dot-ca-gov)" -> null
-               "serving.knative.dev/lastModifier"  = "Rae.Bonfanti@dot.ca.gov (global/workforcePools/dot-ca-gov)" -> null
#                (1 unchanged element hidden)
            }
!~          effective_labels      = {
-               "cloud.googleapis.com/location" = "us-west2" -> null
#                (1 unchanged element hidden)
            }
!~          generation            = 1 -> 0
-           labels                = {} -> null
!~          namespace             = "cal-itp-data-infra-staging" -> (known after apply)
!~          resource_version      = "AAZBm54gG04" -> (known after apply)
!~          self_link             = "/apis/serving.knative.dev/v1/namespaces/473674835135/services/cal-bc-staging" -> (known after apply)
!~          uid                   = "2b0af4ba-a601-49ff-8475-31844866e984" -> (known after apply)
#            (2 unchanged attributes hidden)
        }

!~      template {
!~          metadata {
!~              generation       = 0 -> (known after apply)
!~              labels           = {
-                   "run.googleapis.com/startupProbeType" = "Default"
                } -> (known after apply)
+               name             = (known after apply)
+               namespace        = (known after apply)
+               resource_version = (known after apply)
+               self_link        = (known after apply)
+               uid              = (known after apply)
#                (1 unchanged attribute hidden)
            }
!~          spec {
!~              container_concurrency = 80 -> (known after apply)
-               node_selector         = {} -> null
+               serving_state         = (known after apply)
#                (2 unchanged attributes hidden)

!~              containers {
+                   name        = (known after apply)
#                    (4 unchanged attributes hidden)

-                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
-                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
+                   env {
+                       name  = "DATABASE_URL"
#                        (1 unchanged attribute hidden)

+                       value_from {
+                           secret_key_ref {
+                               key  = "latest"
+                               name = "cal-bc-staging-database-url"
                            }
                        }
                    }
+                   env {
+                       name  = "SECRET_KEY"
#                        (1 unchanged attribute hidden)

+                       value_from {
+                           secret_key_ref {
+                               key  = "latest"
+                               name = "cal-bc-staging-secret-key"
                            }
                        }
                    }

!~                  resources {
!~                      limits   = {
-                           "cpu"    = "1000m"
-                           "memory" = "512Mi"
                        } -> (known after apply)
-                       requests = {} -> null
                    }

!~                  startup_probe (known after apply)
-                   startup_probe {
-                       failure_threshold     = 1 -> null
-                       initial_delay_seconds = 0 -> null
-                       period_seconds        = 240 -> null
-                       timeout_seconds       = 240 -> null

-                       tcp_socket {
-                           port = 8000 -> null
                        }
                    }

#                    (1 unchanged block hidden)
                }
            }
        }

!~      traffic {
+           url             = (known after apply)
#            (4 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #34](https://github.com/cal-itp/cal-bc/actions/runs/18662449168)